In [1]:
#Panda Arthemetic Operations

In [2]:
import pandas as pd

In [3]:
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[11,22,33,44,55]})
var

   A   B
0  1  11
1  2  22
2  3  33
3  4  44
4  5  55

In [4]:
var["C"]=var["A"]+var["B"]
var

   A   B   C
0  1  11  12
1  2  22  24
2  3  33  36
3  4  44  48
4  5  55  60

In [5]:
var["C"]=var["A"]-var["B"]
var

   A   B   C
0  1  11 -10
1  2  22 -20
2  3  33 -30
3  4  44 -40
4  5  55 -50

In [9]:
var["C"]=var["A"] * var["B"]
var

   A   B    C
0  1  11   11
1  2  22   44
2  3  33   99
3  4  44  176
4  5  55  275

In [10]:
var["C"]=var["A"]/var["B"]
var

   A   B         C
0  1  11  0.090909
1  2  22  0.090909
2  3  33  0.090909
3  4  44  0.090909
4  5  55  0.090909

In [ ]:
#Logical Operations

In [11]:
var1=pd.DataFrame({"A":[10,20,30,40,50],"B":[11,22,33,44,55]})
var1

    A   B
0  10  11
1  20  22
2  30  33
3  40  44
4  50  55

In [13]:
var1["Python"]=var1["A"]<=20
var1["Java"]=var1["B"]>=16
var1

    A   B  Python   Java
0  10  11    True  False
1  20  22    True   True
2  30  33   False   True
3  40  44   False   True
4  50  55   False   True